// Generated by jextract

package magick;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _DifferenceStatistics {
 *     double red;
 *     double green;
 *     double blue;
 *     double opacity;
 *     double combined;
 * }
 * }
 */
public class _DifferenceStatistics {

    _DifferenceStatistics() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        magick_wand_h.C_DOUBLE.withName("red"),
        magick_wand_h.C_DOUBLE.withName("green"),
        magick_wand_h.C_DOUBLE.withName("blue"),
        magick_wand_h.C_DOUBLE.withName("opacity"),
        magick_wand_h.C_DOUBLE.withName("combined")
    ).withName("_DifferenceStatistics");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfDouble red$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("red"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double red
     * }
     */
    public static final OfDouble red$layout() {
        return red$LAYOUT;
    }

    private static final long red$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double red
     * }
     */
    public static final long red$offset() {
        return red$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double red
     * }
     */
    public static double red(MemorySegment struct) {
        return struct.get(red$LAYOUT, red$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double red
     * }
     */
    public static void red(MemorySegment struct, double fieldValue) {
        struct.set(red$LAYOUT, red$OFFSET, fieldValue);
    }

    private static final OfDouble green$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("green"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double green
     * }
     */
    public static final OfDouble green$layout() {
        return green$LAYOUT;
    }

    private static final long green$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double green
     * }
     */
    public static final long green$offset() {
        return green$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double green
     * }
     */
    public static double green(MemorySegment struct) {
        return struct.get(green$LAYOUT, green$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double green
     * }
     */
    public static void green(MemorySegment struct, double fieldValue) {
        struct.set(green$LAYOUT, green$OFFSET, fieldValue);
    }

    private static final OfDouble blue$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("blue"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double blue
     * }
     */
    public static final OfDouble blue$layout() {
        return blue$LAYOUT;
    }

    private static final long blue$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double blue
     * }
     */
    public static final long blue$offset() {
        return blue$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double blue
     * }
     */
    public static double blue(MemorySegment struct) {
        return struct.get(blue$LAYOUT, blue$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double blue
     * }
     */
    public static void blue(MemorySegment struct, double fieldValue) {
        struct.set(blue$LAYOUT, blue$OFFSET, fieldValue);
    }

    private static final OfDouble opacity$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("opacity"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double opacity
     * }
     */
    public static final OfDouble opacity$layout() {
        return opacity$LAYOUT;
    }

    private static final long opacity$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double opacity
     * }
     */
    public static final long opacity$offset() {
        return opacity$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double opacity
     * }
     */
    public static double opacity(MemorySegment struct) {
        return struct.get(opacity$LAYOUT, opacity$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double opacity
     * }
     */
    public static void opacity(MemorySegment struct, double fieldValue) {
        struct.set(opacity$LAYOUT, opacity$OFFSET, fieldValue);
    }

    private static final OfDouble combined$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("combined"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double combined
     * }
     */
    public static final OfDouble combined$layout() {
        return combined$LAYOUT;
    }

    private static final long combined$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double combined
     * }
     */
    public static final long combined$offset() {
        return combined$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double combined
     * }
     */
    public static double combined(MemorySegment struct) {
        return struct.get(combined$LAYOUT, combined$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double combined
     * }
     */
    public static void combined(MemorySegment struct, double fieldValue) {
        struct.set(combined$LAYOUT, combined$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

