// Generated by jextract

package magick;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _ImageChannelStatistics {
 *     double maximum;
 *     double minimum;
 *     double mean;
 *     double standard_deviation;
 *     double variance;
 * }
 * }
 */
public class _ImageChannelStatistics {

    _ImageChannelStatistics() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        magick_wand_h.C_DOUBLE.withName("maximum"),
        magick_wand_h.C_DOUBLE.withName("minimum"),
        magick_wand_h.C_DOUBLE.withName("mean"),
        magick_wand_h.C_DOUBLE.withName("standard_deviation"),
        magick_wand_h.C_DOUBLE.withName("variance")
    ).withName("_ImageChannelStatistics");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfDouble maximum$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("maximum"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double maximum
     * }
     */
    public static final OfDouble maximum$layout() {
        return maximum$LAYOUT;
    }

    private static final long maximum$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double maximum
     * }
     */
    public static final long maximum$offset() {
        return maximum$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double maximum
     * }
     */
    public static double maximum(MemorySegment struct) {
        return struct.get(maximum$LAYOUT, maximum$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double maximum
     * }
     */
    public static void maximum(MemorySegment struct, double fieldValue) {
        struct.set(maximum$LAYOUT, maximum$OFFSET, fieldValue);
    }

    private static final OfDouble minimum$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("minimum"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double minimum
     * }
     */
    public static final OfDouble minimum$layout() {
        return minimum$LAYOUT;
    }

    private static final long minimum$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double minimum
     * }
     */
    public static final long minimum$offset() {
        return minimum$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double minimum
     * }
     */
    public static double minimum(MemorySegment struct) {
        return struct.get(minimum$LAYOUT, minimum$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double minimum
     * }
     */
    public static void minimum(MemorySegment struct, double fieldValue) {
        struct.set(minimum$LAYOUT, minimum$OFFSET, fieldValue);
    }

    private static final OfDouble mean$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("mean"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double mean
     * }
     */
    public static final OfDouble mean$layout() {
        return mean$LAYOUT;
    }

    private static final long mean$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double mean
     * }
     */
    public static final long mean$offset() {
        return mean$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double mean
     * }
     */
    public static double mean(MemorySegment struct) {
        return struct.get(mean$LAYOUT, mean$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double mean
     * }
     */
    public static void mean(MemorySegment struct, double fieldValue) {
        struct.set(mean$LAYOUT, mean$OFFSET, fieldValue);
    }

    private static final OfDouble standard_deviation$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("standard_deviation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double standard_deviation
     * }
     */
    public static final OfDouble standard_deviation$layout() {
        return standard_deviation$LAYOUT;
    }

    private static final long standard_deviation$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double standard_deviation
     * }
     */
    public static final long standard_deviation$offset() {
        return standard_deviation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double standard_deviation
     * }
     */
    public static double standard_deviation(MemorySegment struct) {
        return struct.get(standard_deviation$LAYOUT, standard_deviation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double standard_deviation
     * }
     */
    public static void standard_deviation(MemorySegment struct, double fieldValue) {
        struct.set(standard_deviation$LAYOUT, standard_deviation$OFFSET, fieldValue);
    }

    private static final OfDouble variance$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("variance"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double variance
     * }
     */
    public static final OfDouble variance$layout() {
        return variance$LAYOUT;
    }

    private static final long variance$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double variance
     * }
     */
    public static final long variance$offset() {
        return variance$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double variance
     * }
     */
    public static double variance(MemorySegment struct) {
        return struct.get(variance$LAYOUT, variance$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double variance
     * }
     */
    public static void variance(MemorySegment struct, double fieldValue) {
        struct.set(variance$LAYOUT, variance$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

